{
  "Discord_TOS": "Fine print identified:\nHere are the notable fine print and key points from Discord's Terms of Service:\n\nEffective Date and Updates: The terms are effective from September 29, 2025, with the last update being on August 29, 2025.\n\nArbitration Clause:\nThe section titled “Settling Disputes Between You and Discord” contains an arbitration clause and class-action waiver. This means users may be required to settle disputes through arbitration instead of in court, which could significantly affect legal rights.\nUsers must attempt to resolve disputes informally before initiating arbitration.\n\nLiability Limitations:\nDiscord limits its liability for damages to the greater of $100 or the amounts paid by the user in the three months preceding the claim.\nDiscord is not liable for indirect, incidental, or consequential damages, including but not limited to lost profits or data.\n\nIndemnity: Users agree to indemnify and hold Discord harmless from claims related to their use of the services or their own content.\n\n‘AS IS’ Disclaimer: Services are provided \"AS IS,\" meaning Discord makes no warranties about the services, explicitly disclaiming warranties of merchantability and fitness for a particular purpose.\n\nTerm & Termination:\nUsers can terminate their agreement by deleting their account. Discord can suspend or terminate accounts with or without notice for violations of terms or inactivity.\n\nData Charges: Users are responsible for any mobile data charges incurred while accessing Discord’s services.\n\nGoverning Law: The terms are governed by the laws of the United States and the state of California, with disputes subject to exclusive jurisdiction in New Castle County, Delaware.\n\nUpdate Notifications: Discord may change the terms and will provide 30 days' notice for material changes that affect user rights. Continued use after changes signifies acceptance.\n\nOpt-out of Arbitration: Users can opt out of the arbitration agreement within 30 days of agreeing to these terms by sending an email to arbitration-opt-out@discord.com.\n\nSmall Claims: Users can still bring claims in small claims court, regardless of the arbitration agreement.\n\nIt's advised to carefully read the entire terms for a full understanding of rights and responsibilities when using Discord services.",
  "Apple_Purchase_Agreement": "Fine print identified:\nHere are some notable points of fine print in the provided Apple Purchase Agreement:\n\nAcceptance and Binding Terms:\n- The document states that a Purchase Order (PO) does not constitute a firm offer and may be revoked anytime prior to acceptance.\n- It mentions that acceptance of a PO binds the seller to the terms whether or not the seller acknowledges it in writing.\n\nCancellations and Fees:\n- Apple reserves the right to cancel a PO without liability at any time prior to shipment or commencement of services. Seller will not impose any charges due to such cancellation.\n\nRisk of Loss:\n- Seller retains all risk of loss until title transfers to Apple, stating that title passes upon receipt by Apple at the designated destination.\n\nPayment Details:\n- Seller must invoice Apple within 90 days of completing the service or delivering goods. Late submissions incur a 2% discount on the invoiced amount.\n- Payment terms stipulate that Apple pays within 45 days of receipt of correct invoices.\n\nWarranties:\n- The agreement lays out extensive warranty conditions for both goods (15 months warranty) and services (performed in a professional manner) and mandates disclosure of warranty issues and remedies.\n\nIndemnity:\n- Seller must indemnify Apple against various potential claims, including those related to personal injury, intellectual property rights infringement, and compliance with laws.\n\nConfidentiality:\n- Seller must keep Apple's confidential information private and restrict its dissemination. This obligation continues after the agreement's termination.\n\nTermination Rights:\n- Apple can terminate the agreement for convenience with ten days written notice, which limits the seller’s ability to continue providing goods or services.\n\nLimitation of Liability:\n- The agreement limits Apple’s liability for indirect, special or consequential damages, further protecting Apple from potential claims.\n\nGoverning Law and Jurisdiction:\n- The agreement specifies that it is governed by Singapore law and any disputes must be resolved in Singapore, including a requirement for mediation prior to litigation.\n\nCompliance Requirements:\n- Seller must comply with a range of legal and regulatory obligations, including tax responsibilities and safety standards.\n\nExclusive Rights to Work Product:\n- All work products created will belong exclusively to Apple, with the seller agreeing not to assert any claims over such work.\n\nNo Exclusions for Third Party Rights:\n- The agreement explicitly states that the Contracts (Rights of Third Parties) Act does not apply.\n\nThese conditions are designed to protect Apple's interests while imposing certain responsibilities and limitations on the seller."
}